tutorials/freelyPropagatingFlame/CH4/0/CH4
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Version:  3.0.1                                 |
|   \  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      CH4;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0.055167017;

boundaryField
{
    bottom
    {
        type            fixedValue;
        value           uniform 0.055167017;
    }
    top
    {
        type            inletOutlet;
        inletValue 		uniform 0;
        value           uniform 0.055167017;
    }
    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
