tutorials/freelyPropagatingFlame/CH4/system/sampleDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      sampleDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

interpolationScheme cellPoint;

setFormat       raw;

sets
(
    axis
    {
        type    face;
        axis    x;
        start   (0 0.001 0.001);
        end     (0.02 0.001 0.001);
        nPoints 1000;
    }
);

//fields          (Z T CH3OH O2 H2O CO2 OH H2 H CO rho Cp mu kappa);
fields			(D_CH4 D_H2	D_O2 D_CO2 D_CO);

// ************************************************************************* //
